docs: use mermaid.js instead for diagrams
